In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

s = pd.Series([1, 3, 5, np.nan, 6, 90, 9])
s

0     1.0
1     3.0
2     5.0
3     NaN
4     6.0
5    90.0
6     9.0
dtype: float64

In [4]:
dates = pd.date_range('20170802', periods=9)
dates

DatetimeIndex(['2017-08-02', '2017-08-03', '2017-08-04', '2017-08-05',
               '2017-08-06', '2017-08-07', '2017-08-08', '2017-08-09',
               '2017-08-10'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df = pd.DataFrame(np.random.randn(9, 5), index=dates, columns=list('ABCDF'))
df
df.dtypes

A    float64
B    float64
C    float64
D    float64
F    float64
dtype: object

In [11]:
df2 = pd.DataFrame({
    'A': 1.,
    'B': pd.Timestamp('20170802'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    "F": 'foo'
})
df2

     A          B    C  D      E    F
0  1.0 2017-08-02  1.0  3   test  foo
1  1.0 2017-08-02  1.0  3  train  foo
2  1.0 2017-08-02  1.0  3   test  foo
3  1.0 2017-08-02  1.0  3  train  foo

In [13]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [17]:
df2.head()

     A          B    C  D      E    F
0  1.0 2017-08-02  1.0  3   test  foo
1  1.0 2017-08-02  1.0  3  train  foo
2  1.0 2017-08-02  1.0  3   test  foo
3  1.0 2017-08-02  1.0  3  train  foo

In [19]:
df2.tail(3)

     A          B    C  D      E    F
1  1.0 2017-08-02  1.0  3  train  foo
2  1.0 2017-08-02  1.0  3   test  foo
3  1.0 2017-08-02  1.0  3  train  foo

In [20]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [21]:
df.index

DatetimeIndex(['2017-08-02', '2017-08-03', '2017-08-04', '2017-08-05',
               '2017-08-06', '2017-08-07', '2017-08-08', '2017-08-09',
               '2017-08-10'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df.columns

Index([u'A', u'B', u'C', u'D', u'F'], dtype='object')

In [23]:
df.values

array([[ 0.39074709, -0.9159019 , -0.14886609, -0.39285853,  0.70564355],
       [-0.24832956,  0.44870987,  0.06142223, -2.05105422,  0.20956292],
       [-0.91800029,  1.09803886,  0.37709798, -1.16981514,  0.89290457],
       [-0.57421367,  0.99309063, -1.41373797, -0.20912199,  0.11013247],
       [-0.78953558, -0.36760547, -0.69465291, -0.3473759 ,  0.21768351],
       [ 0.12942333, -1.38915026, -0.43458003,  0.95333858, -1.93492783],
       [-0.03185828, -0.0036402 , -0.82741226, -0.51949458,  1.06783085],
       [-0.10161024,  0.16899674,  0.34247007, -0.85484643, -0.2257449 ],
       [-1.40672835, -0.00786585,  1.49383866, -0.27285392, -2.5478749 ]])

In [24]:
df.describe()

              A         B         C         D         F
count  9.000000  9.000000  9.000000  9.000000  9.000000
mean  -0.394456  0.002741 -0.138269 -0.540454 -0.167199
std    0.571924  0.815902  0.844066  0.810028  1.253689
min   -1.406728 -1.389150 -1.413738 -2.051054 -2.547875
25%   -0.789536 -0.367605 -0.694653 -0.854846 -0.225745
50%   -0.248330 -0.003640 -0.148866 -0.392859  0.209563
75%   -0.031858  0.448710  0.342470 -0.272854  0.705644
max    0.390747  1.098039  1.493839  0.953339  1.067831

In [25]:
df.T

,2017-08-02 00:00:00,2017-08-03 00:00:00,2017-08-04 00:00:00,2017-08-05 00:00:00,2017-08-06 00:00:00,2017-08-07 00:00:00,2017-08-08 00:00:00,2017-08-09 00:00:00,2017-08-10 00:00:00
A,0.390747,-0.248330,-0.918000,-0.574214,-0.789536,0.129423,-0.031858,-0.101610,-1.406728
B,-0.915902,0.448710,1.098039,0.993091,-0.367605,-1.389150,-0.003640,0.168997,-0.007866
C,-0.148866,0.061422,0.377098,-1.413738,-0.694653,-0.434580,-0.827412,0.342470,1.493839
D,-0.392859,-2.051054,-1.169815,-0.209122,-0.347376,0.953339,-0.519495,-0.854846,-0.272854
F,0.705644,0.209563,0.892905,0.110132,0.217684,-1.934928,1.067831,-0.225745,-2.547875

In [26]:
df

                   A         B         C         D         F
2017-08-02  0.390747 -0.915902 -0.148866 -0.392859  0.705644
2017-08-03 -0.248330  0.448710  0.061422 -2.051054  0.209563
2017-08-04 -0.918000  1.098039  0.377098 -1.169815  0.892905
2017-08-05 -0.574214  0.993091 -1.413738 -0.209122  0.110132
2017-08-06 -0.789536 -0.367605 -0.694653 -0.347376  0.217684
2017-08-07  0.129423 -1.389150 -0.434580  0.953339 -1.934928
2017-08-08 -0.031858 -0.003640 -0.827412 -0.519495  1.067831
2017-08-09 -0.101610  0.168997  0.342470 -0.854846 -0.225745
2017-08-10 -1.406728 -0.007866  1.493839 -0.272854 -2.547875

In [28]:
df.sort_index(axis=1, ascending=False)

                   F         D         C         B         A
2017-08-02  0.705644 -0.392859 -0.148866 -0.915902  0.390747
2017-08-03  0.209563 -2.051054  0.061422  0.448710 -0.248330
2017-08-04  0.892905 -1.169815  0.377098  1.098039 -0.918000
2017-08-05  0.110132 -0.209122 -1.413738  0.993091 -0.574214
2017-08-06  0.217684 -0.347376 -0.694653 -0.367605 -0.789536
2017-08-07 -1.934928  0.953339 -0.434580 -1.389150  0.129423
2017-08-08  1.067831 -0.519495 -0.827412 -0.003640 -0.031858
2017-08-09 -0.225745 -0.854846  0.342470  0.168997 -0.101610
2017-08-10 -2.547875 -0.272854  1.493839 -0.007866 -1.406728

In [29]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D         F
2017-08-10 -1.406728 -0.007866  1.493839 -0.272854 -2.547875
2017-08-09 -0.101610  0.168997  0.342470 -0.854846 -0.225745
2017-08-08 -0.031858 -0.003640 -0.827412 -0.519495  1.067831
2017-08-07  0.129423 -1.389150 -0.434580  0.953339 -1.934928
2017-08-06 -0.789536 -0.367605 -0.694653 -0.347376  0.217684
2017-08-05 -0.574214  0.993091 -1.413738 -0.209122  0.110132
2017-08-04 -0.918000  1.098039  0.377098 -1.169815  0.892905
2017-08-03 -0.248330  0.448710  0.061422 -2.051054  0.209563
2017-08-02  0.390747 -0.915902 -0.148866 -0.392859  0.705644

In [30]:
df.sort_index(axis=0, ascending=True)

                   A         B         C         D         F
2017-08-02  0.390747 -0.915902 -0.148866 -0.392859  0.705644
2017-08-03 -0.248330  0.448710  0.061422 -2.051054  0.209563
2017-08-04 -0.918000  1.098039  0.377098 -1.169815  0.892905
2017-08-05 -0.574214  0.993091 -1.413738 -0.209122  0.110132
2017-08-06 -0.789536 -0.367605 -0.694653 -0.347376  0.217684
2017-08-07  0.129423 -1.389150 -0.434580  0.953339 -1.934928
2017-08-08 -0.031858 -0.003640 -0.827412 -0.519495  1.067831
2017-08-09 -0.101610  0.168997  0.342470 -0.854846 -0.225745
2017-08-10 -1.406728 -0.007866  1.493839 -0.272854 -2.547875

In [31]:
df.sort_values(by='B')

                   A         B         C         D         F
2017-08-07  0.129423 -1.389150 -0.434580  0.953339 -1.934928
2017-08-02  0.390747 -0.915902 -0.148866 -0.392859  0.705644
2017-08-06 -0.789536 -0.367605 -0.694653 -0.347376  0.217684
2017-08-10 -1.406728 -0.007866  1.493839 -0.272854 -2.547875
2017-08-08 -0.031858 -0.003640 -0.827412 -0.519495  1.067831
2017-08-09 -0.101610  0.168997  0.342470 -0.854846 -0.225745
2017-08-03 -0.248330  0.448710  0.061422 -2.051054  0.209563
2017-08-05 -0.574214  0.993091 -1.413738 -0.209122  0.110132
2017-08-04 -0.918000  1.098039  0.377098 -1.169815  0.892905

In [62]:
df.sort_values(by='A')

                   A         B         C         D    F
2017-08-10 -1.406728 -0.007866  1.493839 -0.272854  NaN
2017-08-04 -0.918000  1.098039  0.377098 -1.169815  3.0
2017-08-06 -0.789536 -0.367605 -0.694653 -0.347376  5.0
2017-08-05 -0.574214  0.993091 -1.413738 -0.209122  4.0
2017-08-03 -0.248330  0.448710  0.061422 -2.051054  2.0
2017-08-09 -0.101610  0.168997  0.342470 -0.854846  NaN
2017-08-08 -0.031858 -0.003640 -0.827412 -0.519495  NaN
2017-08-07  0.129423 -1.389150 -0.434580  0.953339  6.0
2017-08-02  0.390747 -0.915902 -0.148866 -0.392859  1.0

In [35]:
df['A']

2017-08-02    0.390747
2017-08-03   -0.248330
2017-08-04   -0.918000
2017-08-05   -0.574214
2017-08-06   -0.789536
2017-08-07    0.129423
2017-08-08   -0.031858
2017-08-09   -0.101610
2017-08-10   -1.406728
Freq: D, Name: A, dtype: float64

In [36]:
df['B']

2017-08-02   -0.915902
2017-08-03    0.448710
2017-08-04    1.098039
2017-08-05    0.993091
2017-08-06   -0.367605
2017-08-07   -1.389150
2017-08-08   -0.003640
2017-08-09    0.168997
2017-08-10   -0.007866
Freq: D, Name: B, dtype: float64

In [37]:
df[0:3]

                   A         B         C         D         F
2017-08-02  0.390747 -0.915902 -0.148866 -0.392859  0.705644
2017-08-03 -0.248330  0.448710  0.061422 -2.051054  0.209563
2017-08-04 -0.918000  1.098039  0.377098 -1.169815  0.892905

In [38]:
df['20170801':'20170805']

                   A         B         C         D         F
2017-08-02  0.390747 -0.915902 -0.148866 -0.392859  0.705644
2017-08-03 -0.248330  0.448710  0.061422 -2.051054  0.209563
2017-08-04 -0.918000  1.098039  0.377098 -1.169815  0.892905
2017-08-05 -0.574214  0.993091 -1.413738 -0.209122  0.110132

In [39]:
df.loc[dates[0]]

A    0.390747
B   -0.915902
C   -0.148866
D   -0.392859
F    0.705644
Name: 2017-08-02 00:00:00, dtype: float64

In [40]:
df.loc[:, ['A', 'B']]

                   A         B
2017-08-02  0.390747 -0.915902
2017-08-03 -0.248330  0.448710
2017-08-04 -0.918000  1.098039
2017-08-05 -0.574214  0.993091
2017-08-06 -0.789536 -0.367605
2017-08-07  0.129423 -1.389150
2017-08-08 -0.031858 -0.003640
2017-08-09 -0.101610  0.168997
2017-08-10 -1.406728 -0.007866

In [41]:
df.loc['20170803': '20170805', ['B', 'C']]

                   B         C
2017-08-03  0.448710  0.061422
2017-08-04  1.098039  0.377098
2017-08-05  0.993091 -1.413738

In [42]:
df.loc['20170803', ['A', 'B']]

A   -0.24833
B    0.44871
Name: 2017-08-03 00:00:00, dtype: float64

In [43]:
df.loc['20170802', ['A', 'B']]

A    0.390747
B   -0.915902
Name: 2017-08-02 00:00:00, dtype: float64

In [44]:
df.loc[dates[0], 'A']

0.39074709086286646

In [45]:
df.at[dates[0], 'A']

0.39074709086286646

In [46]:
df.iloc[3]

A   -0.574214
B    0.993091
C   -1.413738
D   -0.209122
F    0.110132
Name: 2017-08-05 00:00:00, dtype: float64

In [47]:
df.iloc[3:5, 0:2]

                   A         B
2017-08-05 -0.574214  0.993091
2017-08-06 -0.789536 -0.367605

In [48]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2017-08-03 -0.248330  0.061422
2017-08-04 -0.918000  0.377098
2017-08-06 -0.789536 -0.694653

In [49]:
df.iloc[1:3, :]

                  A         B         C         D         F
2017-08-03 -0.24833  0.448710  0.061422 -2.051054  0.209563
2017-08-04 -0.91800  1.098039  0.377098 -1.169815  0.892905

In [50]:
df.iloc[1, 1]

0.44870987155630243

In [51]:
df.iat[1, 1]

0.44870987155630243

In [52]:
df[df.A > 0]

                   A         B         C         D         F
2017-08-02  0.390747 -0.915902 -0.148866 -0.392859  0.705644
2017-08-07  0.129423 -1.389150 -0.434580  0.953339 -1.934928

In [53]:
df

                   A         B         C         D         F
2017-08-02  0.390747 -0.915902 -0.148866 -0.392859  0.705644
2017-08-03 -0.248330  0.448710  0.061422 -2.051054  0.209563
2017-08-04 -0.918000  1.098039  0.377098 -1.169815  0.892905
2017-08-05 -0.574214  0.993091 -1.413738 -0.209122  0.110132
2017-08-06 -0.789536 -0.367605 -0.694653 -0.347376  0.217684
2017-08-07  0.129423 -1.389150 -0.434580  0.953339 -1.934928
2017-08-08 -0.031858 -0.003640 -0.827412 -0.519495  1.067831
2017-08-09 -0.101610  0.168997  0.342470 -0.854846 -0.225745
2017-08-10 -1.406728 -0.007866  1.493839 -0.272854 -2.547875

In [54]:
df[df.B>0]

                   A         B         C         D         F
2017-08-03 -0.248330  0.448710  0.061422 -2.051054  0.209563
2017-08-04 -0.918000  1.098039  0.377098 -1.169815  0.892905
2017-08-05 -0.574214  0.993091 -1.413738 -0.209122  0.110132
2017-08-09 -0.101610  0.168997  0.342470 -0.854846 -0.225745

In [56]:
df2

                   A         B         C         D         F
2017-08-02  0.390747 -0.915902 -0.148866 -0.392859  0.705644
2017-08-03 -0.248330  0.448710  0.061422 -2.051054  0.209563
2017-08-04 -0.918000  1.098039  0.377098 -1.169815  0.892905
2017-08-05 -0.574214  0.993091 -1.413738 -0.209122  0.110132
2017-08-06 -0.789536 -0.367605 -0.694653 -0.347376  0.217684
2017-08-07  0.129423 -1.389150 -0.434580  0.953339 -1.934928
2017-08-08 -0.031858 -0.003640 -0.827412 -0.519495  1.067831
2017-08-09 -0.101610  0.168997  0.342470 -0.854846 -0.225745
2017-08-10 -1.406728 -0.007866  1.493839 -0.272854 -2.547875

In [57]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'weo', 'ee', 's', 's','w','wq','q']
df2

                   A         B         C         D         F    E
2017-08-02  0.390747 -0.915902 -0.148866 -0.392859  0.705644  one
2017-08-03 -0.248330  0.448710  0.061422 -2.051054  0.209563  one
2017-08-04 -0.918000  1.098039  0.377098 -1.169815  0.892905  weo
2017-08-05 -0.574214  0.993091 -1.413738 -0.209122  0.110132   ee
2017-08-06 -0.789536 -0.367605 -0.694653 -0.347376  0.217684    s
2017-08-07  0.129423 -1.389150 -0.434580  0.953339 -1.934928    s
2017-08-08 -0.031858 -0.003640 -0.827412 -0.519495  1.067831    w
2017-08-09 -0.101610  0.168997  0.342470 -0.854846 -0.225745   wq
2017-08-10 -1.406728 -0.007866  1.493839 -0.272854 -2.547875    q

In [59]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20170802', periods=6))
s1

2017-08-02    1
2017-08-03    2
2017-08-04    3
2017-08-05    4
2017-08-06    5
2017-08-07    6
Freq: D, dtype: int64

In [61]:
df['F'] = s1
df

                   A         B         C         D    F
2017-08-02  0.390747 -0.915902 -0.148866 -0.392859  1.0
2017-08-03 -0.248330  0.448710  0.061422 -2.051054  2.0
2017-08-04 -0.918000  1.098039  0.377098 -1.169815  3.0
2017-08-05 -0.574214  0.993091 -1.413738 -0.209122  4.0
2017-08-06 -0.789536 -0.367605 -0.694653 -0.347376  5.0
2017-08-07  0.129423 -1.389150 -0.434580  0.953339  6.0
2017-08-08 -0.031858 -0.003640 -0.827412 -0.519495  NaN
2017-08-09 -0.101610  0.168997  0.342470 -0.854846  NaN
2017-08-10 -1.406728 -0.007866  1.493839 -0.272854  NaN

In [63]:
df.at[dates[0], 'A'] = 0
df.iat[0, 1] = 0

In [64]:
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2017-08-02  0.000000 -0.915902 -0.148866  5  1.0
2017-08-03 -0.248330  0.448710  0.061422  5  2.0
2017-08-04 -0.918000  1.098039  0.377098  5  3.0
2017-08-05 -0.574214  0.993091 -1.413738  5  4.0
2017-08-06 -0.789536 -0.367605 -0.694653  5  5.0
2017-08-07  0.129423 -1.389150 -0.434580  5  6.0
2017-08-08 -0.031858 -0.003640 -0.827412  5  NaN
2017-08-09 -0.101610  0.168997  0.342470  5  NaN
2017-08-10 -1.406728 -0.007866  1.493839  5  NaN

In [65]:
df2 = df.copy()
df2[df2>0] = -df2
df2

                   A         B         C  D    F
2017-08-02  0.000000 -0.915902 -0.148866 -5 -1.0
2017-08-03 -0.248330 -0.448710 -0.061422 -5 -2.0
2017-08-04 -0.918000 -1.098039 -0.377098 -5 -3.0
2017-08-05 -0.574214 -0.993091 -1.413738 -5 -4.0
2017-08-06 -0.789536 -0.367605 -0.694653 -5 -5.0
2017-08-07 -0.129423 -1.389150 -0.434580 -5 -6.0
2017-08-08 -0.031858 -0.003640 -0.827412 -5  NaN
2017-08-09 -0.101610 -0.168997 -0.342470 -5  NaN
2017-08-10 -1.406728 -0.007866 -1.493839 -5  NaN

In [67]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2017-08-02  0.000000 -0.915902 -0.148866  5  1.0  1.0
2017-08-03 -0.248330  0.448710  0.061422  5  2.0  1.0
2017-08-04 -0.918000  1.098039  0.377098  5  3.0  NaN
2017-08-05 -0.574214  0.993091 -1.413738  5  4.0  NaN

In [68]:
df1.dropna(how='any')

                  A         B         C  D    F    E
2017-08-02  0.00000 -0.915902 -0.148866  5  1.0  1.0
2017-08-03 -0.24833  0.448710  0.061422  5  2.0  1.0

In [70]:
df1.fillna(value=2)

                   A         B         C  D    F    E
2017-08-02  0.000000 -0.915902 -0.148866  5  1.0  1.0
2017-08-03 -0.248330  0.448710  0.061422  5  2.0  1.0
2017-08-04 -0.918000  1.098039  0.377098  5  3.0  2.0
2017-08-05 -0.574214  0.993091 -1.413738  5  4.0  2.0

In [71]:
pd.isnull(df1)

                A      B      C      D      F      E
2017-08-02  False  False  False  False  False  False
2017-08-03  False  False  False  False  False  False
2017-08-04  False  False  False  False  False   True
2017-08-05  False  False  False  False  False   True

In [72]:
df.mean()

A   -0.437873
B    0.002741
C   -0.138269
D    5.000000
F    3.500000
dtype: float64

In [73]:
df.mean(1)

2017-08-02    0.987046
2017-08-03    1.452361
2017-08-04    1.711427
2017-08-05    1.601028
2017-08-06    1.629641
2017-08-07    1.861139
2017-08-08    1.034272
2017-08-09    1.352464
2017-08-10    1.269811
Freq: D, dtype: float64

In [76]:
df.apply(np.cumsum)

                   A         B         C   D     F
2017-08-02  0.000000 -0.915902 -0.148866   5   1.0
2017-08-03 -0.248330 -0.467192 -0.087444  10   3.0
2017-08-04 -1.166330  0.630847  0.289654  15   6.0
2017-08-05 -1.740544  1.623937 -1.124084  20  10.0
2017-08-06 -2.530079  1.256332 -1.818737  25  15.0
2017-08-07 -2.400656 -0.132818 -2.253317  30  21.0
2017-08-08 -2.432514 -0.136458 -3.080729  35   NaN
2017-08-09 -2.534124  0.032538 -2.738259  40   NaN
2017-08-10 -3.940853  0.024672 -1.244420  45   NaN

In [77]:
df.apply(lambda x : x.max() - x.min())

A    1.536152
B    2.487189
C    2.907577
D    0.000000
F    5.000000
dtype: float64

In [79]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    0
1    3
2    6
3    3
4    0
5    3
6    0
7    2
8    6
9    2
dtype: int64

In [80]:
s.value_counts()

3    3
0    3
6    2
2    2
dtype: int64

In [81]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [83]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -2.051585  0.050500 -1.217724 -1.011555
1 -0.331512 -0.308953 -0.239286  0.831735
2  1.849772 -1.905736  0.268239 -1.282901
3 -0.583184  2.108420 -0.896851 -0.552759
4 -0.845268 -0.064673  0.445272 -0.987196
5 -0.105978 -1.668487 -0.646589 -0.334916
6  0.715116  0.514076 -1.728001  1.586998
7  0.509619  0.713969  0.287844  0.614909
8  0.240753  0.433037 -0.261594 -1.098865
9  2.093418  1.565078 -0.541695  1.520736

In [84]:
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -2.051585  0.050500 -1.217724 -1.011555
1 -0.331512 -0.308953 -0.239286  0.831735
2  1.849772 -1.905736  0.268239 -1.282901
3 -0.583184  2.108420 -0.896851 -0.552759
4 -0.845268 -0.064673  0.445272 -0.987196
5 -0.105978 -1.668487 -0.646589 -0.334916
6  0.715116  0.514076 -1.728001  1.586998
7  0.509619  0.713969  0.287844  0.614909
8  0.240753  0.433037 -0.261594 -1.098865
9  2.093418  1.565078 -0.541695  1.520736

In [86]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [87]:
right

   key  rval
0  foo     4
1  foo     5

In [88]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [89]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.078703  0.505451  0.315899  0.087761
1  0.449796  0.912742 -1.221646  0.358320
2  2.035146 -0.888876 -0.374721  1.217383
3  0.548419 -0.759515 -2.717456  0.711632
4 -0.314578  0.002719  1.800536  2.630356
5  0.888458 -0.364450 -2.232629 -1.996044
6  0.306056  0.808773  0.065049  0.558419
7 -1.859745  0.224892  0.134775 -0.578324

In [90]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.078703  0.505451  0.315899  0.087761
1  0.449796  0.912742 -1.221646  0.358320
2  2.035146 -0.888876 -0.374721  1.217383
3  0.548419 -0.759515 -2.717456  0.711632
4 -0.314578  0.002719  1.800536  2.630356
5  0.888458 -0.364450 -2.232629 -1.996044
6  0.306056  0.808773  0.065049  0.558419
7 -1.859745  0.224892  0.134775 -0.578324
8  0.548419 -0.759515 -2.717456  0.711632

In [91]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                          'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                          'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.457373  1.237162
1  bar    one -1.046485  0.498181
2  foo    two  0.368655 -0.884021
3  bar  three  0.462507  0.736747
4  foo    two -1.220696 -1.146545
5  bar    two  0.855217 -0.213734
6  foo    one -1.046679  0.848165
7  foo  three -0.134138 -0.704147

In [92]:
df.groupby('A').sum()

            C         D
A
bar  0.271239  1.021194
foo -3.490231 -0.649385

In [93]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -1.046485  0.498181
    three  0.462507  0.736747
    two    0.855217 -0.213734
foo one   -2.504052  2.085327
    three -0.134138 -0.704147
    two   -0.852041 -2.030566

In [97]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one     1.302850  1.823234
      two    -0.073412  0.207610
baz   one    -1.091508  0.846358
      two    -0.478991 -0.017865

In [98]:
stacked = df2.stack()
stacked

first  second
bar    one     A    1.302850
               B    1.823234
       two     A   -0.073412
               B    0.207610
baz    one     A   -1.091508
               B    0.846358
       two     A   -0.478991
               B   -0.017865
dtype: float64

In [99]:
stacked.unstack()

                     A         B
first second
bar   one     1.302850  1.823234
      two    -0.073412  0.207610
baz   one    -1.091508  0.846358
      two    -0.478991 -0.017865

In [100]:
stacked.unstack(1)

second        one       two
first
bar   A  1.302850 -0.073412
      B  1.823234  0.207610
baz   A -1.091508 -0.478991
      B  0.846358 -0.017865

In [101]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.302850 -1.091508
       B  1.823234  0.846358
two    A -0.073412 -0.478991
       B  0.207610 -0.017865

In [102]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
   .....:                    'B' : ['A', 'B', 'C'] * 4,
   .....:                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
   .....:                    'D' : np.random.randn(12),
   .....:                    'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.903212  0.678501
1     one  B  foo -0.499725 -2.031208
2     two  C  foo -0.083387  1.656564
3   three  A  bar -1.307159 -1.009831
4     one  B  bar -1.503711  0.756112
5     one  C  bar -2.094664 -1.541638
6     two  A  foo  0.670360  0.338884
7   three  B  foo  0.310382 -1.354639
8     one  C  foo -1.163212  0.193189
9     one  A  bar -0.563483  1.580490
10    two  B  bar  0.551121  1.531521
11  three  C  bar  0.504055  0.136114

In [103]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.563483  0.903212
      B -1.503711 -0.499725
      C -2.094664 -1.163212
three A -1.307159       NaN
      B       NaN  0.310382
      C  0.504055       NaN
two   A       NaN  0.670360
      B  0.551121       NaN
      C       NaN -0.083387

In [106]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
ts.plot()